def token_display(id, name, price, change, bal, pos):
  if change > 0:
    change = f"\033[0;32m\u25B4{change:.2f}%\033[0m"
  else:
    change = f"\033[0;31m\u25BE{abs(change):.2f}%"

  if id == "chainlink":
    LINK_ART = f"""\033[34m                                   
                   *****               
                ***********            
            +******************        
         ***********   ***********     
         ********         ********            | {name} |
         *****               *****              
         *****               *****          ${price:,}  {change}\033[34m
         *****               *****     
         *****               *****          HOLDINGS: {bal}
         *****               *****          
         ********         ********          BALANCE: ${pos:,.2f}    
         ***********   ***********     
            ******************-        
               .***********.           
                   *****                                                                    
    \033[0m"""                                                     
    return LINK_ART

  elif id == "hedera-hashgraph":                 
    HBAR_TEST = f"""\033[38;2;230;200;250m
              @@@@@@@@@@@          
           @@@@         @@@@       
         @@@               @@@     
        @@                   @@    
       @@     @@       @@     @@   
      @@      @@       @@      @@             | {name} |
      @@      @@@@@@@@@@@      @@           
      @@      @@       @@      @@           ${price:,}  {change}\033[38;2;230;200;250m
      @@      @@@@@@@@@@@      @@           
      @@      @@       @@      @@           HOLDINGS: {bal}
       @@     @@       @@     @@   
        @@                   @@             BALANCE: ${pos:,.2f}
         @@@               @@@     
           @@@@         @@@@       
              @@@@@@@@@@@          
    \033[0m"""
    return HBAR_TEST
  
  elif id == "ripple":
    XRP_ART = f"""
    %%%%%                  %%%%%
      %%%%                %%%%  
        %%%%            %%%%                  
          %%%%        %%%%                    | {name} |
            %%%%%%%%%%%%                       
              %%%%%%%%                      ${price:,}  {change}\033[0m
                                           
              %%%%%%%%                      HOLDINGS: {bal} 
            %%%%%%%%%%%%                    
          %%%%        %%%%                  BALANCE: ${pos:,.2f}
        %%%%            %%%%               
      %%%%                %%%%  
    %%%%                    %%%%
    \033[0m"""
    return XRP_ART

  elif id == "spx6900":
    SPX_ART = f"""\033[0;33m                        
                  ÅÆ       ÆÆÆÆÆÆÆÆÆÆ   
                ÆÆ                ÆÆÆÆÆ
            ÆÆÆ                    ÆÆÆÆ 
          ÆÆÆ                      ÆÆÆÆ 
        ÆÆÆÆ                       ÆÆÆ        | {name} |
        ÆÆÆÆ                       ÆÆÆ   
      ÆÆÆÆ                       ÆÆ         ${price:,}  {change}\033[0;33m 
      ÆÆÆÆÆ                     ÆÆ       
     ÆÆÆÆÆ                                  HOLDINGS: {bal}
      ÆÆÆÆÆÆÆ                            
      ÆÆÆÆÆÆÆÆÆ                             BALANCE: ${pos:,.2f}
          ÆÆÆÆÆÆÆÆÆÆÆÆÆ                  
    \033[0m"""
    return SPX_ART

  elif id == "monad":
    MONAD_ART = f"""\033[38;5;53m    
                  üüüüüüüüü               
                üüüüüüüüüüüüü             
              üüüüüüüüüüüüüüüüü           
            üüüüüüüüüü    üüüüüüü         
            üüüüüüü         üüüüüüü            | {name} |
          üüüüüüü            üüüüüüüü      
        üüüüüü               üüüüüüüü       ${price:,}  {change}\033[38;5;53m
        üüüüüüü               üüüüüüü            
        üüüüüüüü               üüüüüü       HOLDINGS: {bal} 
          üüüüüüüü            üüüüüüü      
            üüüüüüü         üüüüüüü         BALANCE: ${pos:,.2f}
            üüüüüüü    üüüüüüüüüü         
              üüüüüüüüüüüüüüüüü           
                üüüüüüüüüüüüü             
                  üüüüüüüüü        
    \033[0m""" 
    return MONAD_ART                                  

  elif id == "ethereum":
    ETH_ART = f"""\033[38;5;66m                       
                       ..                       
                      .+%.                      
                     ..++%%:                     
                    -+++%%%=                    
                   =++++%%%%#                 | {name} | 
                  =+++++%%%%%%                  
                 +++++++%%%%%%%             ${price:,}  {change}\033[38;5;66m     
               .+++++*##@@%%%%%%.               
               ++#######@@@@@@%%%.          HOLDINGS: {bal}  
              -%########@@@@@@@@@-              
              .:.:######@@@@@@:.-:          BALANCE: ${pos:,.2f}    
               .++-..%##@@@. =%%.               
                 .++++=. ..*%%%%                 
                  -+++++%%%%%=.                 
                    .++++%%%%.                   
                     +++%%%                     
                      -+%*                      
                       ..                       
    \033[0m"""
    return ETH_ART

  elif id == "bitcoin":
    BTC_ART = f"""\033[38;5;214m                                            
                      ÆÆ  ÆÆ                      
                      ÆÆ  ÆÆ                      
                ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ                   
                    ÆÆÆÆÆÆÆÆÆÆÆÆÆÆ            | {name} |      
                    ÆÆÆÆÆ     ÆÆÆÆí                
                    ÆÆÆÆÆ    ›ÆÆÆÆ          ${price:,}  {change}\033[38;5;214m          
                    ÆÆÆÆÆÆÆÆÆÆÆÆÅ                       
                    ÆÆÆÆÆÆÆÆÆÆÆÆÆ           HOLDINGS: {bal}      
                    ÆÆÆÆÆ    GÆÆÆÆÅ                
                    ÆÆÆÆÆ     ÅÆÆÆÆ         BALANCE: ${pos:,.2f}        
                    ÆÆÆÆÆ     ÆÆÆÆÆ                
                  ›ÆÆÆÆÆÆÆÆÆÆÆÆÆÆ                 
                ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÇ                   
                      ÆÆ  ÆÆ                      
                      ÆÆ  ÆÆ                      
    \033[0m"""
    return BTC_ART                     
